app/controllers/group_administrating_controller.rb

SELECT * FROM `groups` WHERE (`groups`.user_id = 17) LIMIT 1
SELECT * FROM `users` WHERE (`users`.`id` = 17) AND ( (`users`.`type` = 'GroupAdministrator' ) ) LIMIT 1
---
  def index
    @curent_user = GroupAdministrator.find_by_id(session[:user_id])
    @simple_users = @curent_user.simple_users
    @group = @curent_user.group

SELECT * FROM `users` WHERE (`users`.`id` = 6) AND ( (`users`.`type` = 'GroupAdministrator' ) ) LIMIT 1
---
  def new_user
    @simple_user = SimpleUser.new
    @simple_user.group_id = GroupAdministrator.find_by_id(session[:user_id]).group_id

SELECT * FROM `users` WHERE (`users`.`id` = 6) AND ( (`users`.`type` = 'GroupAdministrator' ) ) LIMIT 1
---
  def edit_user
    @simple_user = SimpleUser.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 6) AND ( (`users`.`type` = 'GroupAdministrator' ) ) LIMIT 1
---
  def show_user
    @user = SimpleUser.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 6) AND ( (`users`.`type` = 'GroupAdministrator' ) ) LIMIT 1
INSERT INTO `users` (`name`, `salt`, `updated_at`, `hashed_password`, `type`, `group_id`, `login`, `surname`, `created_at`) VALUES('g', '658997600.732524195620258', '2010-03-08 18:50:05', 'df51d289fdc11ea25ea312d90fb5f84ce7571249', 'SimpleUser', NULL, 'g', 'g', '2010-03-08 18:50:05')
---
  def create_user
    @simple_user = SimpleUser.new(params[:simple_user])
    @simple_user.group_id = User.find_by_id(session[:user_id]).group_id
    #    @user.type = params[:user][:type]
    respond_to do |format|
      if @simple_user.save

SELECT * FROM `users` WHERE (`users`.`id` = 6) AND ( (`users`.`type` = 'GroupAdministrator' ) ) LIMIT 1
UPDATE `users` SET `updated_at` = '2010-03-08 19:35:02', `name` = 'gg' WHERE `id` = 9
---
  def update_user
    @simple_user = SimpleUser.find(params[:id])
    if can_access_user
      respond_to do |format|
        if @simple_user.update_attributes(params[:simple_user])

SELECT * FROM `users` WHERE (`users`.`id` = 6) AND ( (`users`.`type` = 'GroupAdministrator' ) ) LIMIT 1
DELETE FROM `users` WHERE `id` = 9
---
  def destroy_user
    @user = SimpleUser.find(params[:id])
    if can_access_user
      @user.destroy