app/controllers/personal_area_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 2) AND ( (`users`.`type` = 'GroupAdministrator' ) ) LIMIT 1
---
  def index
    @user = User.find_by_id(session[:user_id])

SELECT * FROM `users` WHERE (`users`.`id` = 5) AND ( (`users`.`type` = 'GroupAdministrator' ) ) LIMIT 1
---
  def my_entries
    @user = User.find_by_id(session[:user_id])