app/controllers/search_controller.rb

SELECT * FROM `entries` WHERE (city = 'Moscow' AND street = '' AND rooms_count = '')
---
  def result

    @qs = "" #query_string todo: remove in production
    @search_condition = SearchCondition.new(params[:search_condition])
    @qs = @search_condition.get_sql_condition
    @entries = Entry.find(:all,:conditions => @qs) #todo: SQLINJECTIONABLE

SELECT * FROM `entries` WHERE (furniture = 'no_matter' AND city = 'Москва' AND tv = 'no_matter' AND washing_machine = 'no_matter' AND refridgerator = 'no_matter' AND phone = 'no_matter')
---
  def result_flat
    @qs = "" #query_string todo: remove in production
    @search_condition = SearchCondition.new(params[:search_condition])
    @qs = @search_condition.get_sql_condition
    @entries = Entry.find(:all,:conditions => @qs) #todo: SQLINJECTIONABLE