app/controllers/site_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1
---
  def index
    if User.find_by_id(session[:user_id])