app/controllers/users_controller.rb

  def create
   @user = User.new(params[:user])
#    @user = Root.new(params[:user])
    @user.type = params[:user][:type]
    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `salt`, `updated_at`, `hashed_password`, `type`, `group_id`, `login`, `surname`, `created_at`) VALUES('name', '647180600.114630203258394', '2010-03-07 20:36:49', '18a730420bda7968c53455c68c3cb0a3bf451344', 'SimpleUser', 1, 'user2', 'surname', '2010-03-07 20:36:49')

  def update
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 5)

  def find_for_group
    User.find();
---
SELECT * FROM `users` ORDER BY name