app/controllers/user_entries_controller.rb

  def index
    @entries = User.find_by_id(session[:user_id]).entries
---
SELECT * FROM `entries` WHERE (`entries`.user_id = 5)
SELECT * FROM `users` WHERE (`users`.`id` = 5) AND ( (`users`.`type` = 'GroupAdministrator' ) ) LIMIT 1

  def show
    #todo: add entry  check that entry belongs to current user
    @entry = Entry.find(params[:id])
---
SELECT * FROM `entries` WHERE (`entries`.`id` = 0)

  def edit
    #todo: add entry  check that entry belongs to current user
    @entry = Entry.find(params[:id])
---
SELECT * FROM `entries` WHERE (`entries`.`id` = 25)

  def edit_rent
    #todo: add entry  check that entry belongs to current user
    @rent_entry = RentEntry.find(params[:id])
---
SELECT * FROM `entries` WHERE (`entries`.`id` = 25) AND ( (`entries`.`type` = 'RentEntry' ) )

  def create_rent
    @rent_entry = RentEntry.new(params[:rent_entry])
    #entry is created for curent user
    @rent_entry.user_id = session[:user_id]
    @subway_station = SubwayStation.find_by_id(params[:subway_station][:id])
    respond_to do |format|
      if @rent_entry.save
        if @subway_station != nil
          @ess = @rent_entry.entries_subway_stations.create(:subway_station_id => @subway_station.id,:time_to => params[:subway_station][:time_to])
---
SELECT * FROM `subway_stations` WHERE (`subway_stations`.`id` = '') LIMIT 1
INSERT INTO `entries` (`city`, `disctrict`, `area_kitchen`, `rooms_count`, `rent_time`, `updated_at`, `rent_price`, `type`, `street`, `area_total`, `house_number`, `flat_number`, `contacts`, `user_id`, `comment`, `floor_number`, `created_at`) VALUES(NULL, NULL, NULL, NULL, NULL, '2010-03-07 21:40:10', NULL, 'RentEntry', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2010-03-07 21:40:10')
INSERT INTO `entries_subway_stations` (`subway_station_id`, `entry_id`, `updated_at`, `time_to`, `created_at`) VALUES(2, 52, '2010-03-11 19:06:17', 23, '2010-03-11 19:06:17')

  def create_rent_subway
    @rent_entry = RentEntry.new(params[:rent_entry])
    #entry is created for curent user
    @rent_entry.user_id = session[:user_id]
    @subway_station = SubwayStation.find_by_id(params[:subway_station][:id])
    respond_to do |format|
      if @rent_entry.save
        if @subway_station != nil
          @ess = @rent_entry.entries_subway_stations.create(:subway_station_id => @subway_station.id,:time_to => params[:subway_station][:time_to])
---
SELECT * FROM `subway_stations` WHERE (`subway_stations`.`id` = '8') LIMIT 1
INSERT INTO `entries` (`city`, `disctrict`, `area_kitchen`, `rooms_count`, `rent_time`, `updated_at`, `rent_price`, `type`, `street`, `area_total`, `house_number`, `flat_number`, `contacts`, `user_id`, `comment`, `floor_number`, `created_at`) VALUES('', '', NULL, NULL, NULL, '2010-03-11 18:26:38', NULL, 'RentEntry', '', NULL, '', NULL, '', 2, '', NULL, '2010-03-11 18:26:38')
INSERT INTO `entries_subway_stations` (`subway_station_id`, `entry_id`, `updated_at`, `time_to`, `created_at`) VALUES(8, 38, '2010-03-11 18:26:38', NULL, '2010-03-11 18:26:38')

  def update_rent
    #todo: add entry  check that entry belongs to current user
    @rent_entry = RentEntry.find(params[:id])
    if @rent_entry.user_id != session[:user_id]
      flash[:notice] = "You can't edit this entry"
      redirect_to :action => "index"
    end

    respond_to do |format|
      if @rent_entry.update_attributes(params[:rent_entry])
---
SELECT * FROM `entries` WHERE (`entries`.`id` = 25) AND ( (`entries`.`type` = 'RentEntry' ) )
UPDATE `entries` SET `city` = 'MSCghjghj', `updated_at` = '2010-03-07 23:26:19' WHERE `id` = 25

  def destroy
    #todo: add entry  check that entry belongs to current user
    @entry = Entry.find(params[:id])
    if @entry.user_id != session[:user_id]
      flash[:notice] = "You can't edit this entry"
      redirect_to :action => "index"
    end

    @entry.destroy
---
SELECT * FROM `entries` WHERE (`entries`.`id` = 19)
DELETE FROM `entries` WHERE `id` = 19