class Metro
  @@stations = {
    85 => "Авиамоторная",
    13 => "Автозаводская",
    97 => ">Академическая",
    53 => "Александровский сад",
    105 => "Алексеевская",
    135 => "Алтуфьево",
    156 => "Аннино",
    50 => "Арбатская",
    5 => "Аэропорт",
    109 => "Бабушкинская",
    57 => "Багратионовская",
    71 => "Баррикадная",
    47 => "Бауманская",
    69 => "Беговая",
    7 => "Белорусская",
    93 =>"Беляево",
    131 => "Бибирево",
    30 => "Библиотека Ленина",
    120 => "Боровицкая",
    107 => "Ботанический сад",
    145 => "Братиславская",
    39 => "Черкизовская",
    128 => "Чертановская",
    119 => "Чеховская",
    33 => "Чистые пруды",
    137 => "Чкаловская",
    99 => "Шаболовская",
    84 => "Шоссе энтузиастов",
    41 => "Щелковская",
    66 => "Щукинская",
    46 => "Электрозаводская",
    23 => "Юго-Западная",
    129 => "Южная",
    155 =>"Янгеля Академика",
    90 => "Ясенево"
  }
  
  def self.get_stations
    @@stations
  end

end
